app/controllers/recipes_controller.rb

  def create
    @recipe = current_user.recipes.build(recipe_params)
    authorize @recipe

    if @recipe.save
---
INSERT INTO "recipes" ("title", "cook_time", "difficulty", "created_at", "updated_at") VALUES ('Butter Chicken', 50, 'Medium', '2025-10-05 23:49:51.955506', '2025-10-05 23:49:51.955506') RETURNING "id"

  def update
    authorize @recipe

    if @recipe.update(recipe_params)
---
UPDATE "recipes" SET "updated_at" = '2025-10-05 23:49:51.965860' WHERE "recipes"."id" = 1